{
  "documents": [
    {
      "title": "How to set up your printer",
      "body": "Firstly remove the foil from frame parts. The best way to do it is to use your nails, you can also use some other tools but thay can't be sharp because you can scratch it. \n\n First thing is to build main frame. On included SD card you can find video tutorial about how to assemble the frame unfortunatly there is only how to assemble frame (nothing about connection e.t.c.). \n\n  Now you can combine X, Y and Z axis with other parts. Before turning it on add two small piece of plastic on the top of Z axis to set bars in good position. Screw all thing very strong but be careful to not destroy anything."
    },
    {
      "title": "Flashing the firmware onto the main board",
      "body": "The process for flashing firmware (at least in the context of the 3D printing world) consists of something like the following:\n\n    Make sure you are running the latest version of Arduino software and have the correct libraries installed. If your board is not Arduino-based, obtain the comparable software.\n\n   Download the correct firmware for your printer.\n\n    Make any adjustments to the firmware, which is common for hardware modifications.\n\n Select the correct serial port and type of Arduino board for your printer.\n\n    Compile and upload the firmware.\n\nNot much to it, is there? Sometimes it is just that easy. If not, resources are available to help you along. See the section below, ‘Additional resources’."
    },
    {
      "title": "About Stepper Motors",
      "body": " Stepper motors are DC motors that move in discrete steps. They have multiple coils that are organized in groups called \"phases\". By energizing each phase in sequence, the motor will rotate, one step at a time.\n\nWith a computer controlled stepping you can achieve very precise positioning and/or speed control. For this reason, stepper motors are the motor of choice for many precision motion control applications.\n\nStepper motors come in many different sizes and styles and electrical characteristics. This guide details what you need to know to pick the right motor for the job.\n\n Stepper motors are often misconceived as the lesser of servo motors, but as a matter of fact, they are highly reliable just like servo motors. The motor operates by accurately synchronizing with the pulse signal output from the controller to the driver, achieving highly accurate positioning and speed control. Stepper motors feature high torque and low vibration at low-speeds, ideal for applications requiring quick positioning in short distance."
    },
    {
      "title": "Laser Cutting your frame",
      "body": "Turns out, Makerspace 3D printers are fickle and down an awful lot. So instead of printing a 3D printer I decided to Laser cut my first printer. In effect I’m using the laminate printer method to create an FDM printer.\n\nThe embedded video will give you an impression of what components are made up of.\n\nYou can download the entire model at: https://grabcad.com/library/laminated-prusa-i3-printer-1\n\nAll components can be laser cut using 12x28 inch Acrylic sheet (3mm thick).\n\nIn this instructable I will not go into the wiring of the Ramps 1.4 setup. That is covered in the followup instructable Wiring 3D Printer RAMPS 1.4\n\nI've tried to accompany most steps with images in each of the majors steps. If you get lost in the words, look at the images in the sequence their presented."
    },
    {
      "title": "Parts List",
      "body": "M3 hex socket srew 6mm http://amzn.to/2Ds0F6C\n\nM3 hex socket srew 8mm http://amzn.to/2muGT2y\n\nM3 hex socket srew 10mm http://amzn.to/2Dw1V96\n\nM3 hex socket srew 14mm http://amzn.to/2mtqxqN\n\nM3 hex socket srew 20mm http://amzn.to/2FyTCd8\n\nM3 hex socket srew 25mm http://amzn.to/2Fyr3MR\n\nM4 hex socket srew 10mm http://amzn.to/2AXhKmf\n\nM4 hex socket srew 40mm https://amzn.to/2JmOiv6\n\n5/16 threaded rod http://amzn.to/2CXCo7n (or home depot)\n\n5/16 Nuts http://amzn.to/2EEEMAr (or home depot)\n\nAcrylic from McMaster Car https://www.mcmaster.com/#catalog/123/3632/=1b3zn0... 6 sheets of 12\"x24''\n\nSCS8UU Linear Motion Ball Bearing http://amzn.to/2BKukHh\n\nLM8UU Linear Ball Bearing http://amzn.to/2FvqR0S\n\nBed spring leveling components http://amzn.to/2AZiVlZ\n\nFlexible Shaft Couplings 5mm to 8mm http://amzn.to/2Dw1V96\n\n2-Pack - Linear Motion Rod 8 mm x 406mm Shaft https://amzn.to/3eOU3nN\n\nNema 17 1.7A (5 pack) http://amzn.to/2BsMuRb\n\nIdler http://amzn.to/2Dpv2gB\n\nGt2 Timing belt pulley 20 teeth http://amzn.to/2FwmTFb\n\nPrinter Bed http://amzn.to/2DrCW6B\n\nTorsion springs http://amzn.to/2FAvJBQ\n\nMK8 mount http://amzn.to/2mvz8ct\n\nMk8 Extruder http://amzn.to/2DxtzST\n\nGt2 Timing belt http://amzn.to/2DwQbCV"
    },
    {
      "title": "Additional Resources",
      "body": "If you run into a problem, don’t panic. We have some common issues listed below. Check to see if your error message is among them. If not, you will probably have to go to the internet for help. Google is your friend. Arduino will often give you a very long list of error messages in the console. The most critical one is usually the first one. Search for the error message along with the name of your firmware or printer. You will likely find some forum posts pointing you in the right direction.\n\n If you do not turn up anything in your research, you may need to ask a question on a web forum. The best place to ask is probably the forum for your specific printer. The most important thing to remember when asking a question online is to include the full text of the error message. Whenever Arduino gives you an error, there will be a button above the console area which lets you copy the entire text. You can then post it using a service like Pastebin."
    }
  ]
}
